#include <iostream>

using namespace std;

int main() {
    setlocale(0, "");

    int choice;
    int size = 0;

    cout << "[ + ] Программа - “Лабиринт”" << endl;
    cout << "\n[ + ] Размер карты:" << endl;
    cout << "[ 1 ] 15 x 15" << endl;
    cout << "[ 2 ] 20 x 20 (требует инициализации большего массива)" << endl;
    cout << "[ 3 ] 30 x 30 (требует инициализации большего массива)" << endl;
    cout << "\n[ + ] Выберите размер: ";
    cin >> choice;

    if (choice == 1) size = 15;
    else if (choice == 2) size = 20;
    else if (choice == 3) size = 30;
    else size = 15; 

    system("cls || clear");
    cout << "[ + ] Программа - “Лабиринт” (" << size << "x" << size << ")\n" << endl;

    int maze[15][15] = {
        {1,0,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,0,0,0,0,0,0,0,0,1,1,1,1,1,1},
        {1,1,1,1,1,1,0,0,0,1,1,1,1,1,1},
        {1,1,1,1,1,1,0,0,0,0,0,0,1,1,1},
        {1,1,1,1,1,1,0,0,0,1,1,1,1,1,1},
        {1,1,1,1,1,1,0,0,0,0,0,0,0,0,1},
        {1,1,1,1,1,1,1,1,1,1,1,0,0,1,1},
        {1,0,0,0,0,0,0,1,1,1,1,0,0,1,1},
        {1,0,1,1,1,1,0,1,1,1,1,0,0,1,1},
        {1,0,0,0,0,1,0,0,0,0,0,0,0,1,1},
        {1,1,1,1,0,1,1,1,1,1,1,1,0,1,1},
        {1,0,0,0,0,0,0,0,0,0,0,1,0,1,1},
        {1,0,1,1,1,1,1,1,1,1,0,1,0,1,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,0,1}
    };

    for (int i = 0; i < 15; i++) {
        for (int j = 0; j < 15; j++) {

            if (maze[i][j] == 1) {
                cout << "#  "; 
            }
            else {
                cout << ".  "; 
            }
        }
        cout << endl; 
    }

    return 0;
}
